# Задача 2.2. 

# Напишите функцию, которая возвращает номер квартал по номеру месяца
# Например: 
# месяц 2 (февраль) является частью первого квартала; 
# месяц 6 (июнь) является частью второго квартала; 
# месяц 11 (ноябрь) является частью четвертого квартала.

import math

def quarter(month):
    return math.ceil(month / 3)
print(quarter(2)) # 1
print(quarter(6)) # 2
print(quarter(11)) # 4